wosayttn/Gerrit_NuMicro/M2003xC_M2003xD_M2003xE_M2003xG_Series/Library/Device/Nuvoton/M2003/Include/clk_reg.h
     * | :----: | :----:   | :---- |
     * |[3:0]   |FREQSEL   |Clock Output Frequency Selection
     * |        |          |The formula of output frequency is Fout = Fin/2^(N+1).
     * |        |          |Fin is the input clock frequency.
     * |        |          |Fout is the frequency of divider output clock.
     * |        |          |N is the 4-bit value of FREQSEL[3:0].
     * |[4]     |CLKOEN    |Clock Output Enable Bit
     * |        |          |0 = Clock Output function Disabled.
     * |        |          |1 = Clock Output function Enabled.
     * |[5]     |DIV1EN    |Clock Output Divide One Enable Bit
     * |        |          |0 = Clock Output will output clock with source frequency divided by FREQSEL.
     * |        |          |1 = Clock Output will output clock with source frequency.
     * |[6]     |CLK1HZEN  |CLK1HZEN
     * |        |          |Note: This bits has to set to 0.
     * @var CLK_T::CLKDCTL
     * Offset: 0x70  Clock Fail Detector Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[4]     |HXTFDEN   |HXT Clock Fail Detector Enable Bit
     * |        |          |0 = 4~32 MHz external high speed crystal oscillator (HXT) clock fail detector Disabled.
     * |        |          |1 = 4~32 MHz external high speed crystal oscillator (HXT) clock fail detector Enabled.
     * |[5]     |HXTFIEN   |HXT Clock Fail Interrupt Enable Bit
     * |        |          |0 = 4~32 MHz external high speed crystal oscillator (HXT) clock fail interrupt Disabled.
     * |        |          |1 = 4~32 MHz external high speed crystal oscillator (HXT) clock fail interrupt Enabled.
     * |[6]     |HXTFDSEL  |HXT Clock Fail Detector Selection
     * |        |          |0 = 4~32 MHz external high speed crystal oscillator (HXT) clock fail detector after HXT stable.
     * |        |          |1 = 4~32 MHz external high speed crystal oscillator (HXT) clock fail detector bypass HXT stable.
     * |        |          |Note: When HXT Clock Fail Detector Selection is set, detector will keep detect whether HXT is stable or not, prevent HXT fail before stable.
     * |[16]    |HXTFQDEN  |HXT Clock Frequency Monitor Enable Bit
     * |        |          |0 = 4~32 MHz external high speed crystal oscillator (HXT) clock frequency monitor Disabled.
     * |        |          |1 = 4~32 MHz external high speed crystal oscillator (HXT) clock frequency monitor Enabled.
     * |[17]    |HXTFQIEN  |HXT Clock Frequency Monitor Interrupt Enable Bit
     * |        |          |0 = 4~32 MHz external high speed crystal oscillator (HXT) clock frequency monitor fail interrupt Disabled.
     * |        |          |1 = 4~32 MHz external high speed crystal oscillator (HXT) clock frequency monitor fail interrupt Enabled.
     * @var CLK_T::CLKDSTS
     * Offset: 0x74  Clock Fail Detector Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |HXTFIF    |HXT Clock Fail Interrupt Flag (Write Protect)
     * |        |          |0 = 4~32 MHz external high speed crystal oscillator (HXT) clock is normal.
     * |        |          |1 = 4~32 MHz external high speed crystal oscillator (HXT) clock stops.
     * |        |          |Note 1: Write 1 to clear the bit to 0.
     * |        |          |Note 2: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |[8]     |HXTFQIF   |HXT Clock Frequency Monitor Interrupt Flag (Write Protect)
     * |        |          |0 = 4~32 MHz external high speed crystal oscillator (HXT) clock is normal.
     * |        |          |1 = 4~32 MHz external high speed crystal oscillator (HXT) clock frequency is abnormal.
     * |        |          |Note 1: Write 1 to clear the bit to 0.
     * |        |          |Note 2: This bit is write protected. Refer to the SYS_REGLCTL register.
     * @var CLK_T::CDUPB
     * Offset: 0x78  Clock Frequency Detector Upper Boundary Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[9:0]   |UPERBD    |HXT Clock Frequency Detector Upper Boundary
     * |        |          |The bits define the high value of frequency monitor window.
     * |        |          |When HXT frequency monitor value higher than this register, the HXT frequency detect fail interrupt flag will set to 1.
     * |        |          |Frequency out of range will be asserted when (HIRC_period*512) / HXT_period )> CLK_DUPB.
     * @var CLK_T::CDLOWB
     * Offset: 0x7C  Clock Frequency Detector Lower Boundary Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[9:0]   |LOWERBD   |HXT Clock Frequency Detector Lower Boundary
     * |        |          |The bits define the low value of frequency monitor window.
     * |        |          |When HXT frequency monitor value lower than this register, the HXT frequency detect fail interrupt flag will set to 1.
     * |        |          |Frequency out of range will be asserted when ((HIRC_period*512) / HXT_period) < CLK_CDLOWB.
     * @var CLK_T::HXTCTL
     * Offset: 0x84  High Speed Crystal Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |GAIN      |HXT Gain Control Bit (Write Protect)
     * |        |          |Gain control is used to enlarge the gain of crystal to make sure crystal work normally
     * |        |          |If gain control is enabled, crystal will consume more power than gain control off.
     * |        |          |0000 = HXT frequency is lower than from 4 MHz.
     * |        |          |0001 = HXT frequency is lower than from 4 MHz
     * |        |          |0010 = HXT frequency is from 4 MHz to 12 MHz..
     * |        |          |0011 = HXT frequency is from 4 MHz to 12 MHz.
     * |        |          |0100 = HXT frequency is from 12 MHz to 16 MHz.
     * |        |          |0101 = HXT frequency is from 12 MHz to 16 MHz.
     * |        |          |0110 = HXT frequency is from 12 MHz to 16 MHz..
     * |        |          |0111 = HXT frequency is from 16 MHz to 24 MHz
     * |        |          |1000 = HXT frequency is from 16 MHz to 24 MHz.
     * |        |          |1001 = HXT frequency is from 16 MHz to 24 MHz.
     * |        |          |1010 = HXT frequency is from 16 MHz to 24 MHz.
     * |        |          |1011 = HXT frequency is from 24 MHz to 32 MHz.
     * |        |          |1100 = HXT frequency is from 24 MHz to 32 MHz.
     * |        |          |1101 = HXT frequency is from 24 MHz to 32 MHz.
     * |        |          |Note: These bits are write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note: These bits are write protected. Refer to the SYS_REGLCTL register.
     * @var CLK_T::PMUCTL
     * Offset: 0x90  Power Manager Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[2:0]   |PDMSEL    |Power-down Mode Selection (Write Protect)
     * |        |          |These bits control chip power-down mode grade selection when CPU executes WFI/WFE instruction.
     * |        |          |000 = Power-down mode is selected (PD).
     * |        |          |001 = Reserved.
     * |        |          |010 = Reserved.
     * |        |          |011 = Reserved.
     * |        |          |100 = Reserved.
     * |        |          |101 = Reserved.
     * |        |          |110 = Reserved.
     * |        |          |111 = Reserved.
     * |        |          |Note: These bits are write protected. Refer to the SYS_REGLCTL register.
     * |[7]     |WRBUSY    |Write Busy Flag (Read Only)
     * |        |          |If CLK_PMUCTL be written, this bit be asserted automatic by hardware, and be de-asserted when write procedure finish.
     * |        |          |0 = CLK_PMUCTL write ready.
     * |        |          |1 = CLK_PMUCTL write ignore.
     * |[8]     |WKTMREN   |Wake-up Timer Enable Bit (Write Protect)
     * |        |          |0 = Wake-up timer disable at Power-down mode.
     * |        |          |1 = Wake-up timer enabled at Power-down mode.
     * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |[11:9]  |WKTMRIS   |Wake-up Timer Time-out Interval Select Bits (Write Protect)
     * |        |          |These bits control wake-up timer time-out interval when chip under Power-down mode.
     * |        |          |000 = Time-out interval is 128 LIRC clocks (12.8ms).
     * |        |          |001 = Time-out interval is 256 LIRC clocks (25.6ms).
     * |        |          |010 = Time-out interval is 512 LIRC clocks (51.2ms).
     * |        |          |011 = Time-out interval is 1024 LIRC clocks (102.4ms).
     * |        |          |100 = Time-out interval is 4096 LIRC clocks (409.6ms).
     * |        |          |101 = Time-out interval is 8192 LIRC clocks (819.2ms).
     * |        |          |110 = Time-out interval is 16384 LIRC clocks (1638.4ms).
     * |        |          |111 = Time-out interval is 65536 LIRC clocks (6553.6ms).
     * |        |          |Note: These bits are write protected. Refer to the SYS_REGLCTL register.
     * |[25:24] |WKPINEN1  |Wake-up Pin 1 Enable Bits (Write Protect)
     * |        |          |This is control register for GPB.0 to wake-up pin.
     * |        |          |00 = Wake-up pin disable at Power-down mode.
     * |        |          |01 = Wake-up pin rising edge enabled at Power-down mode.
     * |        |          |10 = Wake-up pin falling edge enabled at Power-down mode.
     * |        |          |11 = Wake-up pin both edge enabled at Power-down mode.
     * |        |          |Note: These bits are write protected. Refer to the SYS_REGLCTL register.
     * |[27:26] |WKPINEN2  |Wake-up Pin 2 Enable Bits (Write Protect)
     * |        |          |This is control register for GPB.2 to wake-up pin.
     * |        |          |00 = Wake-up pin disable at Power-down mode.
     * |        |          |01 = Wake-up pin rising edge enabled at Power-down mode.
     * |        |          |10 = Wake-up pin falling edge enabled at Power-down mode.
     * |        |          |11 = Wake-up pin both edge enabled at Power-down mode.
     * |        |          |Note: These bits are write protected. Refer to the SYS_REGLCTL register.
     * |[29:28] |WKPINEN3  |Wake-up Pin 3 Enable Bits (Write Protect)
     * |        |          |This is control register for GPB.12 to wake-up pin.
     * |        |          |00 = Wake-up pin disable at Power-down mode.
     * |        |          |01 = Wake-up pin rising edge enabled at Power-down mode.
     * |        |          |10 = Wake-up pin falling edge enabled at Power-down mode.
     * |        |          |11 = Wake-up pin both edge enabled at Power-down mode.
     * |        |          |Note: These bits are write protected. Refer to the SYS_REGLCTL register.
     * @var CLK_T::PMUSTS
     * Offset: 0x94  Power Manager Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[1]     |TMRWK     |Timer Wake-up Flag (Read Only)
     * |        |          |This flag indicates that wake-up of chip from Power-down mode was requested by wakeup timer time-out. 
     * |[3]     |PINWK1    |Pin 1 Wake-up Flag (Read Only)
     * |        |          |This flag indicates that wake-up of chip from Power-down mode uEE52as requested by a transition of the Wake-up pin (GPB.0).
     * |[4]     |PINWK2    |Pin 2 Wake-up Flag (Read Only)
     * |        |          |This flag indicates that wake-up of chip from Power-down mode uEE52as requested by a transition of the Wake-up pin (GPB.2).
     * |[5]     |PINWK3    |Pin 3 Wake-up Flag (Read Only)
     * |        |          |This flag indicates that wake-up of chip from Power-down mode uEE52as requested by a transition of the Wake-up pin (GPB.12).
     * |[9]     |GPBWK     |GPB Wake-up Flag (Read Only)
     * |        |          |This flag indicates that wake-up of chip from Power-down mode uEE52as requested by a transition of selected one GPB group pins.
     * |[10]    |GPCWK     |GPC Wake-up Flag (Read Only)
     * |        |          |This flag indicates that wake-up of chip from Power-down mode uEE52as requested by a transition of selected one GPC group pins.
     * |[12]    |LVRWK     |LVR Wake-up Flag (Read Only)
     * |        |          |This flag indicates that wakeup of device from Power-down mode uEE52as requested with a LVR happened. 
     * |[13]    |BODWK     |BOD Wake-up Flag (Read Only)
     * |        |          |This flag indicates that wakeup of device from Power-down mode uEE52as requested with a BOD happened.
     * |[31]    |CLRWK     |Clear Wake-up Flag
     * |        |          |0 = No clear.
     * |        |          |1 = Clear all of wake-up flag.
     * |        |          |Note: This bit is auto cleared by hardware.
     * @var CLK_T::SWKDBCTL
     * Offset: 0x9C  Power-down Wake-up De-bounce Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |SWKDBCLKSEL|Power-down Wake-up De-bounce Sampling Cycle Selection
     * |        |          |0000 = Sample wake-up input once per 1 clocks.
     * |        |          |0001 = Sample wake-up input once per 2 clocks.
     * |        |          |0010 = Sample wake-up input once per 4 clocks.
     * |        |          |0011 = Sample wake-up input once per 8 clocks.
     * |        |          |0100 = Sample wake-up input once per 16 clocks.
     * |        |          |0101 = Sample wake-up input once per 32 clocks.
     * |        |          |0110 = Sample wake-up input once per 64 clocks.
     * |        |          |0111 = Sample wake-up input once per 128 clocks.
     * |        |          |1000 = Sample wake-up input once per 256 clocks.
     * |        |          |1001 = Sample wake-up input once per 2*256 clocks.
     * |        |          |1010 = Sample wake-up input once per 4*256 clocks.
     * |        |          |1011 = Sample wake-up input once per 8*256 clocks.
     * |        |          |1100 = Sample wake-up input once per 16*256 clocks.
     * |        |          |1101 = Sample wake-up input once per 32*256 clocks.
     * |        |          |1110 = Sample wake-up input once per 64*256 clocks.
     * |        |          |1111 = Sample wake-up input once per 128*256 clocks.
     * |        |          |Note: De-bounce counter clock source is the 10kHz internal low speed RC oscillator (LIRC).
     * @var CLK_T::PASWKCTL
     * Offset: 0xA0  GPA Power-down Wake-up Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |WKEN      |Standby Power-down Pin Wake-up Enable Bit
     * |        |          |0 = GPA group pin wake-up function Disabled.
     * |        |          |1 = GPA group pin wake-up function Enabled.
     * |[1]     |PRWKEN    |Pin Rising Edge Wake-up Enable Bit
     * |        |          |0 = GPA group pin rising edge wake-up function Disabled.
     * |        |          |1 = GPA group pin rising edge wake-up function Enabled.
     * |[2]     |PFWKEN    |Pin Falling Edge Wake-up Enable Bit
     * |        |          |0 = GPA group pin falling edge wake-up function Disabled.
     * |        |          |1 = GPA group pin falling edge wake-up function Enabled.
     * |[7:4]   |WKPSEL    |GPA Standby Power-down Wake-up Pin Select
     * |        |          |0000 = GPA.0 wake-up function Enabled.
     * |        |          |0001 = GPA.1 wake-up function Enabled.
     * |        |          |0010 = GPA.2 wake-up function Enabled.
     * |        |          |0011 = GPA.3 wake-up function Enabled.
     * |        |          |0100 = GPA.4 wake-up function Enabled.
     * |        |          |0101 = GPA.5 wake-up function Enabled.
     * |        |          |0110 = GPA.6 wake-up function Enabled.
     * |        |          |0111 = GPA.7 wake-up function Enabled.
     * |        |          |1000 = GPA.8 wake-up function Enabled.
     * |        |          |1001 = GPA.9 wake-up function Enabled.
     * |        |          |1010 = GPA.10 wake-up function Enabled.
     * |        |          |1011 = GPA.11 wake-up function Enabled.
     * |        |          |1100 = GPA.12 wake-up function Enabled.
     * |        |          |1101 = GPA.13 wake-up function Enabled.
     * |        |          |1110 = GPA.14 wake-up function Enabled.
     * |        |          |1111 = GPA.15 wake-up function Enabled.
     * |[8]     |DBEN      |GPA Input Signal De-bounce Enable Bit
     * |        |          |The DBEN bit is used to enable the de-bounce function for each corresponding I/O
     * |        |          |If the input signal pulse width cannot be sampled by continuous two de-bounce sample cycle, the input signal transition is seen as the signal bounce and will not trigger the wakeup.The de-bounce clock source is the 10 kHz internal low speed RC oscillator (LIRC).
     * |        |          |0 = Standby power-down wake-up pin De-bounce function Disabled.
     * |        |          |1 = Standby power-down wake-up pin De-bounce function Enabled.
     * |        |          |The de-bounce function is valid only for edge triggered.
     * @var CLK_T::PBSWKCTL
     * Offset: 0xA4  GPB Power-down Wake-up Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |WKEN      |Power-down Pin Wake-up Enable Bit
     * |        |          |0 = GPB group pin wake-up function Disabled.
     * |        |          |1 = GPB group pin wake-up function Enabled.
     * |[1]     |PRWKEN    |Pin Rising Edge Wake-up Enable Bit
     * |        |          |0 = GPB group pin rising edge wake-up function Disabled.
     * |        |          |1 = GPB group pin rising edge wake-up function Enabled.
     * |[2]     |PFWKEN    |Pin Falling Edge Wake-up Enable Bit
     * |        |          |0 = GPB group pin falling edge wake-up function Disabled.
     * |        |          |1 = GPB group pin falling edge wake-up function Enabled.
     * |[7:4]   |WKPSEL    |GPB Standby Power-down Wake-up Pin Select
     * |        |          |0000 = GPB.0 wake-up function Enabled.
     * |        |          |0001 = GPB.1 wake-up function Enabled.
     * |        |          |0010 = GPB.2 wake-up function Enabled.
     * |        |          |0011 = GPB.3 wake-up function Enabled.
     * |        |          |0100 = GPB.4 wake-up function Enabled.
     * |        |          |0101 = GPB.5 wake-up function Enabled.
     * |        |          |0110 = GPB.6 wake-up function Enabled.
     * |        |          |0111 = GPB.7 wake-up function Enabled.
     * |        |          |1000 = GPB.8 wake-up function Enabled.
     * |        |          |1001 = GPB.9 wake-up function Enabled.
     * |        |          |1010 = GPB.10 wake-up function Enabled.
     * |        |          |1011 = GPB.11 wake-up function Enabled.
     * |        |          |1100 = GPB.12 wake-up function Enabled.
     * |        |          |1101 = GPB.13 wake-up function Enabled.
     * |        |          |1110 = GPB.14 wake-up function Enabled.
     * |        |          |1111 = GPB.15 wake-up function Enabled.
     * |[8]     |DBEN      |GPB Input Signal De-bounce Enable Bit
     * |        |          |The DBEN bit is used to enable the de-bounce function for each corresponding I/O
     * |        |          |If the input signal pulse width cannot be sampled by continuous two de-bounce sample cycle, the input signal transition is seen as the signal bounce and will not trigger the wakeup.
     * |        |          |The de-bounce clock source is the 10 kHz internal low speed RC oscillator (LIRC).
     * |        |          |0 = power-down wake-up pin De-bounce function Disabled.
     * |        |          |1 = power-down wake-up pin De-bounce function Enabled.
     * |        |          |Note: The de-bounce function is valid only for edge triggered.
     * @var CLK_T::PCSWKCTL
     * Offset: 0xA8  GPC Power-down Wake-up Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |WKEN      |Standby Power-down Pin Wake-up Enable Bit
     * |        |          |0 = GPC group pin wake-up function Disabled.
     * |        |          |1 = GPC group pin wake-up function Enabled.
     * |[1]     |PRWKEN    |Pin Rising Edge Wake-up Enable Bit
     * |        |          |0 = GPC group pin rising edge wake-up function Disabled.
     * |        |          |1 = GPC group pin rising edge wake-up function Enabled.
     * |[2]     |PFWKEN    |Pin Falling Edge Wake-up Enable Bit
     * |        |          |0 = GPC group pin falling edge wake-up function Disabled.
     * |        |          |1 = GPC group pin falling edge wake-up function Enabled.
     * |[7:4]   |WKPSEL    |GPC Power-down Wake-up Pin Select
     * |        |          |0000 = GPC.0 wake-up function Enabled.
     * |        |          |0001 = GPC.1 wake-up function Enabled.
     * |        |          |0010 = GPC.2 wake-up function Enabled.
     * |        |          |0011 = GPC.3 wake-up function Enabled.
     * |        |          |0100 = GPC.4 wake-up function Enabled.
     * |        |          |0101 = GPC.5 wake-up function Enabled.
     * |        |          |0110 = GPC.6 wake-up function Enabled.
     * |        |          |0111 = GPC.7 wake-up function Enabled.
     * |        |          |1110 = GPC.14 wake-up function Enabled.
     * |        |          |Others are reserved
     * |[8]     |DBEN      |GPC Input Signal De-bounce Enable Bit
     * |        |          |The DBEN bit is used to enable the de-bounce function for each corresponding I/O
     * |        |          |If the input signal pulse width cannot be sampled by continuous two de-bounce sample cycle, the input signal transition is seen as the signal bounce and will not trigger the wakeup.
     * |        |          |The de-bounce clock source is the 10 kHz internal low speed RC oscillator (LIRC).
     * |        |          |0 = power-down wake-up pin De-bounce function Disabled.
     * |        |          |1 = power-down wake-up pin De-bounce function Enabled.
     * |        |          |The de-bounce function is valid only for edge triggered.
     * @var CLK_T::PDSWKCTL
     * Offset: 0xAC  GPD Power-down Wake-up Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |WKEN      |Standby Power-down Pin Wake-up Enable Bit
     * |        |          |0 = GPD group pin wake-up function Disabled.
     * |        |          |1 = GPD group pin wake-up function Enabled.
