wosayttn/Gerrit_NuMicro/M2003xC_M2003xD_M2003xE_M2003xG_Series/Library/Device/Nuvoton/M2003/Include/clk_reg.h
     * |[1]     |PRWKEN    |Pin Rising Edge Wake-up Enable Bit
     * |        |          |0 = GPD group pin rising edge wake-up function Disabled.
     * |        |          |1 = GPD group pin rising edge wake-up function Enabled.
     * |[2]     |PFWKEN    |Pin Falling Edge Wake-up Enable Bit
     * |        |          |0 = GPD group pin falling edge wake-up function Disabled.
     * |        |          |1 = GPD group pin falling edge wake-up function Enabled.
     * |[7:4]   |WKPSEL    |GPD Power-down Wake-up Pin Select
     * |        |          |0000 = GPD.0 wake-up function Enabled.
     * |        |          |0001 = GPD.1 wake-up function Enabled.
     * |        |          |0010 = GPD.2 wake-up function Enabled.
     * |        |          |0011 = GPD.3 wake-up function Enabled.
     * |        |          |1111 = GPD.15 wake-up function Enabled.
     * |        |          |Others are reserved
     * |[8]     |DBEN      |GPD Input Signal De-bounce Enable Bit
     * |        |          |The DBEN bit is used to enable the de-bounce function for each corresponding I/O
     * |        |          |If the input signal pulse width cannot be sampled by continuous two de-bounce sample cycle, the input signal transition is seen as the signal bounce and will not trigger the wakeup.
     * |        |          |The de-bounce clock source is the 10 kHz internal low speed RC oscillator (LIRC).
     * |        |          |0 = power-down wake-up pin De-bounce function Disabled.
     * |        |          |1 = power-down wake-up pin De-bounce function Enabled.
     * |        |          |The de-bounce function is valid only for edge triggered.
     * @var CLK_T::IOPDCTL
     * Offset: 0xB0  GPIO Power-down Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |IOHR      |GPIO Hold Release
     * |        |          |When GPIO enter power-down mode, all I/O status are hold to keep normal operating status.
     * |        |          |After chip was waked up from power-down mode, the I/O are still keep hold status until user set this bit to release I/O hold status.
     * |        |          |Note: This bit is auto cleared by hardware.
     * @var CLK_T::HXTFSEL
     * Offset: 0xB4  HXT Filter Select Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |HXTFDIS   |HXT Filter Disable Bit
     * |        |          |0 = HXT filter Enabled
     * |        |          |1 = HXT filter Disabled
     */

    __IO uint32_t PWRCTL;                /*!< [0x0000] System Power-down Control Register                               */
    __IO uint32_t AHBCLK;                /*!< [0x0004] AHB Devices Clock Enable Register                                */
    __IO uint32_t APBCLK0;               /*!< [0x0008] APB Devices Clock Enable Register 0                              */
    __IO uint32_t APBCLK1;               /*!< [0x000c] APB Devices Clock Enable Register 1                              */
    __IO uint32_t CLKSEL0;               /*!< [0x0010] Clock Source Select Register 0                                   */
    __IO uint32_t CLKSEL1;               /*!< [0x0014] Clock Source Select Register 1                                   */
    __IO uint32_t CLKSEL2;               /*!< [0x0018] Clock Source Select Register 2                                   */
    __I  uint32_t RESERVE0[1];
    __IO uint32_t CLKDIV0;               /*!< [0x0020] Clock Divider Number Register 0                                  */
    __I  uint32_t RESERVE1[4];
    __IO uint32_t PCLKDIV;               /*!< [0x0034] APB Clock Divider Register                                       */
    __I  uint32_t RESERVE2[6];
    __I  uint32_t STATUS;                /*!< [0x0050] Clock Status Monitor Register                                    */
    __I  uint32_t RESERVE3[3];
    __IO uint32_t CLKOCTL;               /*!< [0x0060] Clock Output Control Register                                    */
	__I  uint32_t RESERVE4[3];      
    __IO uint32_t CLKDCTL;               /*!< [0x0070] Clock Fail Detector Control Register                             */
    __IO uint32_t CLKDSTS;               /*!< [0x0074] Clock Fail Detector Status Register                              */
    __IO uint32_t CDUPB;                 /*!< [0x0078] Clock Frequency Detector Upper Boundary Register                 */
    __IO uint32_t CDLOWB;                /*!< [0x007c] Clock Frequency Detector Lower Boundary Register                 */
	__I  uint32_t RESERVE5[1];      
    __IO uint32_t HXTCTL;                /*!< [0x0084] High Speed Crystal Control Register                              */
	__I  uint32_t RESERVE6[2];      
    __IO uint32_t PMUCTL;                /*!< [0x0090] Power Manager Control Register                                   */
    __IO uint32_t PMUSTS;                /*!< [0x0094] Power Manager Status Register                                    */
    __I  uint32_t RESERVE7[1];
    __IO uint32_t SWKDBCTL;              /*!< [0x009c] Power-down Wake-up De-bounce Control Register                    */
    __IO uint32_t PASWKCTL;              /*!< [0x00a0] GPA Power-down Wake-up Control Register                          */
    __IO uint32_t PBSWKCTL;              /*!< [0x00a4] GPB Power-down Wake-up Control Register                          */
    __IO uint32_t PCSWKCTL;              /*!< [0x00a8] GPC Power-down Wake-up Control Register                          */
    __IO uint32_t PDSWKCTL;              /*!< [0x00ac] GPD Power-down Wake-up Control Register                          */
    __IO uint32_t IOPDCTL;               /*!< [0x00b0] GPIO Power-down Control Register                                 */
    __IO uint32_t HXTFSEL;               /*!< [0x00b4] HXT Filter Select Register                                       */
} CLK_T;

/**
    @addtogroup CLK_CONST CLK Bit Field Definition
    Constant Definitions for CLK Controller
  @{
*/

#define CLK_PWRCTL_HXTEN_Pos             (0)                                               /*!< CLK_T::PWRCTL: HXTEN Position          */
#define CLK_PWRCTL_HXTEN_Msk             (0x1ul << CLK_PWRCTL_HXTEN_Pos)                   /*!< CLK_T::PWRCTL: HXTEN Mask              */

